УчетИНагрузкаППС/src/InformationRegisters/ОтветственныеЛицаОрганизации/ОтветственныеЛицаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиОтветственныхЛиц</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетИНагрузкаППС/src/Enums/РолиОтветственныхЛиц/РолиОтветственныхЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиОтветственныхЛиц</name>
  <enumValues>
    <name>РуководительОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПроректорПоУчебнойРаботе</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>НачальникКадров</name>
  </enumValues>
  <enumValues>
    <name>НачальникУМУ</name>
  </enumValues>
  <enumValues>
    <name>РуководительПодразделения</name>
  </enumValues>
</mdclass:Enum>

УчетИНагрузкаППС/src/InformationRegisters/ОтветственныеЛицаОрганизации/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Подразделение")
	И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Подразделение) Тогда
		Запись.Роль = Перечисления.РолиОтветственныхЛиц.РуководительПодразделения;	
		ЗаблокироватьВыборРоли();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	Если Не КадроваяСтруктураКлиентСервер.ДляРолиОтветственногоЛицаДоступноПодразделение(Запись.Роль) Тогда
		Запись.Подразделение = Неопределено;
	КонецЕсли;
	
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФорму()
	Элементы.Подразделение.Видимость = КадроваяСтруктураКлиентСервер.ДляРолиОтветственногоЛицаДоступноПодразделение(Запись.Роль);
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьВыборРоли()
	Элементы.Роль.Доступность = Ложь;
КонецПроцедуры

#КонецОбласти
